dhmobile/app/Http/View/Composers/MenuComposer.php

    public function compose(View $view)
    {
        $menus = Menu::select('id', 'name', 'parent_id',)->where('active', 1)->orderByDesc('id')->get();
---
select `id`, `name`, `parent_id` from `menus` where `active` = 1 order by `id` desc