dhmobile/app/Http/Services/CartService.php

    public function getCustomer()
    {
        return Customer::orderByDesc('id')->paginate(15);
---
select * from `customers` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `customers`