dhmobile/app/Http/Services/Product/ProductAdminService.php

    public function getMenu()
    {
        return Menu::where('active', 1)->get();
---
select * from `menus` where `active` = 1

    public function insert($request)
    {
        $isValidPrice = $this->isValidPrice($request);
        if ($isValidPrice === false) return false;

        try {
            $request->except('_token');
            Product::create($request->all());
---
insert into `products` (`name`, `menu_id`, `description`, `content`, `price`, `price_sale`, `quantity`, `thumb`, `active`, `updated_at`, `created_at`) values ('Do Thu', '1', 'Do Thu', '<p>Do Thu</p>', '1234', '12', '2', '/storage/uploads/2023/04/04/iphone-14.webp', '1', '2023-04-04 06:57:26', '2023-04-04 06:57:26')

    public function get()
    {
        return Product::with('menu')
            ->orderByDesc('id')->paginate(15);
---
select * from `menus` where `menus`.`id` in (1, 8)
select * from `products` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `products`