dhmobile/app/Http/Services/Product/ProductService.php

select `id`, `name`, `price`, `price_sale`, `thumb` from `products` order by `id` desc limit 16
---
    public function get($page = null)
    {
        return Product::select('id', 'name', 'price', 'price_sale', 'thumb',)
            ->orderByDesc('id')
            ->when($page != null, function ($query) use ($page) {
                $query->offset($page * self::LIMIT);
            })
            ->limit(self::LIMIT)
            ->get();

select * from `menus` where `menus`.`id` in (8)
select * from `products` where `id` = '2' and `active` = 1 limit 1
---
    public function show($id)
    {
        return Product::where('id', $id)
            ->where('active', 1)
            ->with('menu')
            ->firstOrFail();

select `id`, `name`, `price`, `price_sale`, `thumb` from `products` where `active` = 1 and `id` != '2' order by `id` desc limit 8
---
    public function more($id)
    {
        return Product::select('id', 'name', 'price', 'price_sale', 'thumb')
            ->where('active', 1)
            ->where('id', '!=', $id)
            ->orderByDesc('id')
            ->limit(8)
            ->get();